---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Clear
source: html/2b4b95a5-f375-d43e-263f-ba3c71992c51.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Clear Method

Removes every conduit type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```